{
    "en": {
        "welcome": "Welcome!",
        "newton_first_law_dlg_goblins_1": "The goblins are pushing back! This brings the net force (sum of forces) back to zero.",
        "title": "Mighty Force Knights\n<size=30>Newton's Law 1 and 2</size>",
        "newton_first_law_dlg_next_1": "Excellent! As you can see, the side with more force will determine the direction of the net force acting on the object.",
        "act_2_end_dlg_1": "A large meteoroid is approaching Earth! Total destruction awaits us if nothing is done!",
        "wheelsAcceleration": "Wheel's Acceleration",
        "confirmDesc": "Are you sure you want to restart the level?",
        "begin": "BEGIN",
        "targetsEliminated": "Targets Eliminated",
        "newton_first_law_dlg_kidnap_2": "Let me drop an object that will help us in this predicament. This will show us the first law in action.",
        "newton_second_law_desc": "Newton's second law states that the acceleration of an object is proportional to the net force acting on it, and inversely proportional to its mass.",
        "accel": "Acceleration",
        "newton_first_law_dlg_block2_2": "We have enough knights to overcome this force. Summon the mighty knights for this one last push!",
        "pressToProceed": "Press this button when you are ready to continue.",
        "newton_second_law_dlg_7": "The wheel continues to roll. There is no change in velocity.",
        "launch": "LAUNCH",
        "weight": "Weight",
        "forceGravity": "Force Gravity",
        "newton_second_law_dlg_5": "A mighty knight has brought us a wheel to demonstrate. The wheel is enchanted with magical trails to allow us to observe its motion.",
        "pressLaunch": "Press the LAUNCH button.",
        "newton_first_law_dlg_1": "This means that an object will keep doing what it is doing, be it sitting or moving, until it is bothered by a bunch of forces (net force).",
        "dragWeightsHelp": "Drag these weights on top of the platform.",
        "newton_first_law_dlg_goblins_2": "Summon more knights to overcome the goblins on the other side!",
        "newton_balanced_force": "Balanced force.",
        "newton_first_law_title": "Newton's First Law",
        "act_2_end_dlg_2": "Seek the golden ball, for it will grant you the force to thwart the impending doom.",
        "newton_first_law_desc": "Newton's first law states that an object at rest will remain at rest, and an object in motion will maintain a constant velocity unless acted upon by a net external force.",
        "newton_second_law_graph_1": "The graph maps out the trails across time along the x and y axis. Be sure to check the velocity and acceleration by scrolling down.",
        "falling": "Falling due to Gravity",
        "credits": "CREDITS",
        "newton_second_law_dlg_1": "Acceleration is what causes an object’s velocity to change over time. Which means the object will speed up, slow down, or change direction.",
        "newton_first_law_inertia_2_dlg_2": "Observe how the forces are interacting on this balance scale.",
        "graphReminder": "Remember to check the graph to analyze the trajectory of the cannonball.",
        "newton_second_law_title": "Newton's Second Law",
        "sound": "SOUND",
        "weight_gravity": "Weight = Force of Gravity",
        "no": "NO",
        "newton_first_law_dlg_landed_1": "Now that the object has landed, the ground is pushing it up. This cancels out the gravity force. The object is now at rest.",
        "acceleration": "ACCELERATION",
        "newton_first_law_inertia_2_dlg_1_b": "Mass measures the amount of matter the object contains. The more mass an object has, the heavier it gets, and more harder to move.",
        "constantMotion": "Constant Motion",
        "newton_second_law_dlg_4": "Note that: force, acceleration, and velocity are all vectors.",
        "trashButtonHelp": "Press and hold the trash button to clear out the Force Fields.",
        "act_3": "Act 3",
        "victory": "VICTORY",
        "velocityX": "velocity(x)",
        "newton_second_law_dlg_3": "As you can see, the more mass an object has, the less it will accelerate from the net force.",
        "end_title": "GLORY IS YOURS",
        "newton_second_law_graph_2": "Observe how the position line curves as velocity increases, indicating that there is acceleration.",
        "end_desc": "Thank you for playing!",
        "playButtonHelp": "Press this button to start the simulation.",
        "direction": "Direction",
        "pressGraph": "Press the GRAPH button.",
        "confirmTitleRestart": "RESTART",
        "proceed": "PROCEED",
        "act_3_title": "The Golden Ball",
        "newton_at_rest": "At Rest",
        "newton_first_law_inertia_2_dlg_3": "The weight on each platform causes the scale to tip. If both platforms have equal weight, they will align horizontally.",
        "newton_in_motion": "In Motion",
        "newton_first_law_dlg_gravity": "The gravity force is pulling the object towards Earth, which allows it to fall.",
        "finish": "FINISH",
        "newton_second_law_2_dlg_3": "Let us bring forth the mighty cannon to vanquish these vermin!",
        "mass_inertia": "Inertia is proportional to Mass",
        "yes": "YES",
        "forceNormal": "Force Ground",
        "axis": "Axis",
        "act_2": "Act 2",
        "victory_act_1_1": "The princess has been rescued!",
        "vector": "Vector",
        "act_1": "Act 1",
        "newton_first_law_inertia_2_dlg_1_a": "Inertia tells us how much resistance an object has in changing motion. It is proportional to the amount of mass of the object.",
        "dragForcePushHelp": "Drag the Force Field to this surface.",
        "act_2_end_dlg_3": "With your knowledge of Newton's law of motion, I am confident that you can accomplish the task!",
        "close": "CLOSE",
        "vel": "Velocity",
        "knightsForcePush": "Knight's Force Push",
        "magnitude": "Magnitude",
        "newton_first_law_inertia_2_victory": "You have opened the treasure chest! Behold, the riches uncovered:",
        "newton_second_law_dlg_8": "As the wheel falls, the velocity in the Y-axis starts to decrease.",
        "options": "OPTIONS",
        "timeSlider": "Time: {0:0.0} - {1:0.0} seconds",
        "force": "Force",
        "forceZeroNetForce": "0 Net Force (Balanced)",
        "newton_zero_accel": "Acceleration = 0 m/s²",
        "timeSliderWheelHint": "Drag the slider to observe the wheel's motion over time.",
        "dragForceAdjustHelp": "You can reposition a Force Field by dragging it.",
        "position": "POSITION",
        "velocityY": "velocity(y)",
        "forceBalanced": "Force Balanced",
        "newton_second_law_graph_3": "If the position line is straight, then velocity is constant, and therefore no acceleration.",
        "hintTooltip": "Press this button to show hints. You can press it again later to show more.",
        "on": "ON",
        "newton_second_law_2_dlg_5": "The cannon can launch projectiles at different directions by adjusting its angle. This will allow us to hit targets at various heights.",
        "newton_first_law_inertia_2_dlg_4": "Here's a locked treasure chest as a demonstration. Put the correct amount of weight on the other platform to unlock it!",
        "newton_second_law_dlg_6": "The knight is pushing the wheel. The velocity in the X-axis is increasing.",
        "dragForceSlider": "Drag the slider to change the Force value.",
        "secondsFormat": "{0:0.0} seconds",
        "mass": "Mass",
        "forceFriction": "Force Friction",
        "newton_first_law_dlg_next_2": "We need one more block to rescue our damsel in distress!",
        "dragAngleHelp": "Drag this to adjust the cannon's angle.",
        "knightPushing": "Knight Pushing",
        "netForce": "Net Force",
        "restart": "RESTART",
        "credits_detail": "Written by: David Dionisio\r\nMusic from: Kevin MacLeod",
        "newton_first_law_dlg_block2_1": "This block has no wheels. The force of friction will allow the block to resist a certain amount of push or pull from the sides.",
        "forcePush": "Force Push",
        "music": "MUSIC",
        "newton_second_law_dlg_4_2": "A vector has a value for each axis. In this case, the x and y. These values can tell us the direction, and the magnitude.",
        "examples": "Examples",
        "newton_second_law_dlg_9": "The nefarious goblins have appeared out of thin air! They are surely up to no good. Push them off the cliff with the wheel.",
        "newton_first_law_dlg_landed_2": "Go ahead and summon a mighty knight to push the object!",
        "off": "OFF",
        "forceUnbalanced": "Force Unbalanced",
        "velocity": "VELOCITY",
        "newton_first_law_inertia_2_dlg_1": "In this scenario, we will learn more about inertia.",
        "newton_second_law_2_dlg_1": "Beware! More goblins have appeared!",
        "newton_first_law_dlg_kidnap_1": "Oh no! The princess has been taken hostage by these nefarious goblins!"
    },
    "es": {
        "welcome": "¡Bienvenido!",
        "newton_first_law_dlg_goblins_1": "¡Los duendes están empujando hacia atrás! Esto hace que la fuerza neta (suma de fuerzas) vuelva a cero.",
        "title": "Caballeros poderosos de la fuerza\n<tamaño=30>Ley 1 y 2 de Newton</size>",
        "newton_first_law_dlg_next_1": "¡Excelente! Como puede ver, el lado con más fuerza determinará la dirección de la fuerza neta que actúa sobre el objeto.",
        "act_2_end_dlg_1": "¡Un gran meteorito se acerca a la Tierra! ¡La destrucción total nos espera si no se hace nada!",
        "wheelsAcceleration": "Aceleración de la rueda",
        "confirmDesc": "¿Estás seguro de que quieres reiniciar el nivel?",
        "begin": "COMENZAR",
        "targetsEliminated": "Objetivos eliminados",
        "newton_first_law_dlg_kidnap_2": "Permítanme dejar caer un objeto que nos ayudará en esta situación. Esto nos mostrará la primera ley en acción.",
        "newton_second_law_desc": "La segunda ley de Newton establece que la aceleración de un objeto es proporcional a la fuerza neta que actúa sobre él e inversamente proporcional a su masa.",
        "accel": "Aceleración",
        "newton_first_law_dlg_block2_2": "Tenemos suficientes caballeros para superar esta fuerza. ¡Invoca a los poderosos caballeros para este último empujón!",
        "pressToProceed": "Pulsa este botón cuando estés listo para continuar.",
        "newton_second_law_dlg_7": "La rueda sigue rodando. No hay cambios en la velocidad.",
        "launch": "LANZAMIENTO",
        "weight": "Peso",
        "forceGravity": "Gravedad de fuerza",
        "newton_second_law_dlg_5": "Un caballero poderoso nos ha traído una rueda para demostrarnos. La rueda está encantada con senderos mágicos para permitirnos observar su movimiento.",
        "pressLaunch": "Pulse el botón LANZAMIENTO.",
        "newton_first_law_dlg_1": "Esto significa que un objeto seguirá haciendo lo mismo, ya sea sentado o en movimiento, hasta que le molestan un montón de fuerzas (fuerza neta).",
        "dragWeightsHelp": "Arrastre estos pesos por encima de la plataforma.",
        "newton_first_law_dlg_goblins_2": "¡Invoca a más caballeros para vencer a los duendes del otro lado!",
        "newton_balanced_force": "Fuerza equilibrada.",
        "newton_first_law_title": "Primera ley de Newton",
        "act_2_end_dlg_2": "Busca la bola de oro, porque te dará la fuerza para frustrar la inminente fatalidad.",
        "newton_first_law_desc": "La primera ley de Newton establece que un objeto en reposo permanecerá en reposo y que un objeto en movimiento mantendrá una velocidad constante a menos que actúe una fuerza externa neta.",
        "newton_second_law_graph_1": "El gráfico asigna los senderos a lo largo del tiempo a lo largo de los ejes x e y. Asegúrese de comprobar la velocidad y la aceleración desplazándose hacia abajo.",
        "falling": "Caída debido a la gravedad",
        "credits": "CRÉDITOS",
        "newton_second_law_dlg_1": "La aceleración es lo que hace que la velocidad de un objeto cambie con el tiempo. Lo que significa que el objeto acelerará, ralentizará o cambiará de dirección.",
        "newton_first_law_inertia_2_dlg_2": "Observe cómo interactúan las fuerzas en esta escala de balance.",
        "graphReminder": "Recuerda revisar el gráfico para analizar la trayectoria de la bala de cañón.",
        "newton_second_law_title": "Segunda ley de Newton",
        "sound": "SONIDO",
        "weight_gravity": "Peso = Fuerza de gravedad",
        "no": "NO",
        "newton_first_law_dlg_landed_1": "Ahora que el objeto ha aterrizado, el suelo lo empuja hacia arriba. Esto cancela la fuerza de gravedad. El objeto está en reposo.",
        "acceleration": "ACELERACIÓN",
        "newton_first_law_inertia_2_dlg_1_b": "La masa mide la cantidad de materia que contiene el objeto. Cuanto más masa tiene un objeto, más pesado se vuelve y más difícil de mover.",
        "constantMotion": "Movimiento constante",
        "newton_second_law_dlg_4": "Tenga en cuenta que: fuerza, aceleración y velocidad son vectores.",
        "trashButtonHelp": "Mantén pulsado el botón de la papelera para borrar los campos de fuerza.",
        "act_3": "Acto 3",
        "victory": "VICTORIA",
        "velocityX": "velocidad (x)",
        "newton_second_law_dlg_3": "Como puedes ver, cuanta más masa tenga un objeto, menos acelerará desde la fuerza neta.",
        "end_title": "LA GLORIA ES TUYA",
        "newton_second_law_graph_2": "Observe cómo se curva la línea de posición a medida que aumenta la velocidad, lo que indica que hay aceleración.",
        "end_desc": "¡Gracias por jugar!",
        "playButtonHelp": "Pulsa este botón para iniciar la simulación.",
        "direction": "Dirección",
        "pressGraph": "Pulse el botón GRÁFICO.",
        "confirmTitleRestart": "REINICIAR",
        "proceed": "PROCEDER",
        "act_3_title": "El Balón de Oro",
        "newton_at_rest": "En reposo",
        "newton_first_law_inertia_2_dlg_3": "El peso de cada plataforma hace que la báscula se incline. Si ambas plataformas tienen el mismo peso, se alinearán horizontalmente.",
        "newton_in_motion": "En movimiento",
        "newton_first_law_dlg_gravity": "La fuerza de gravedad está tirando del objeto hacia la Tierra, lo que le permite caer.",
        "finish": "FINALIZAR",
        "newton_second_law_2_dlg_3": "¡Vamos a sacar el poderoso cañón para vencer a estas alimañas!",
        "mass_inertia": "La inercia es proporcional a la masa",
        "yes": "SÍ",
        "forceNormal": "Tierra de fuerza",
        "axis": "Eje",
        "act_2": "Acto 2",
        "victory_act_1_1": "¡La princesa ha sido rescatada!",
        "vector": "vector",
        "act_1": "Acto 1",
        "newton_first_law_inertia_2_dlg_1_a": "La inercia nos indica cuánta resistencia tiene un objeto al cambiar de movimiento. Es proporcional a la cantidad de masa del objeto.",
        "dragForcePushHelp": "Arrastre el campo de fuerza a esta superficie.",
        "act_2_end_dlg_3": "Con su conocimiento de la ley del movimiento de Newton, estoy seguro de que puede cumplir la tarea.",
        "close": "CERRAR",
        "vel": "Velocidad",
        "knightsForcePush": "Empuje de fuerza del caballero",
        "magnitude": "Magnitud",
        "newton_first_law_inertia_2_victory": "¡Has abierto el cofre del tesoro! He aquí, las riquezas descubiertas:",
        "newton_second_law_dlg_8": "A medida que cae la rueda, la velocidad en el eje Y comienza a disminuir.",
        "options": "OPCIONES",
        "timeSlider": "Tiempo: {0:0 .0} - {1:0 .0} segundos",
        "force": "Fuerza",
        "forceZeroNetForce": "0 Fuerza neta (balanceada)",
        "newton_zero_accel": "Aceleración = 0 m/s²",
        "timeSliderWheelHint": "Arrastre el control deslizante para observar el movimiento de la rueda a lo largo del tiempo.",
        "dragForceAdjustHelp": "Puede cambiar la posición de un campo de fuerza arrastrándolo.",
        "position": "POSICIÓN",
        "velocityY": "velocidad (y)",
        "forceBalanced": "Fuerza equilibrada",
        "newton_second_law_graph_3": "Si la línea de posición es recta, la velocidad es constante y, por lo tanto, no hay aceleración.",
        "hintTooltip": "Pulsa este botón para mostrar sugerencias. Puedes volver a presionarlo más tarde para mostrar más.",
        "on": "Encendido",
        "newton_second_law_2_dlg_5": "El cañón puede lanzar proyectiles en diferentes direcciones ajustando su ángulo. Esto nos permitirá alcanzar objetivos a distintas alturas.",
        "newton_first_law_inertia_2_dlg_4": "Aquí hay un cofre del tesoro cerrado como demostración. Pon la cantidad correcta de peso en la otra plataforma para desbloquearla.",
        "newton_second_law_dlg_6": "El caballero empuja el volante. La velocidad en el eje X está aumentando.",
        "dragForceSlider": "Arrastre el control deslizante para cambiar el valor De la fuersa.",
        "secondsFormat": "{0:0 .0} segundos",
        "mass": "Masa",
        "forceFriction": "Fuerza fricción",
        "newton_first_law_dlg_next_2": "¡Necesitamos un bloque más para rescatar a nuestra damisela en apuros!",
        "dragAngleHelp": "Arrastra esto para guiar el ángulo del cañón.",
        "knightPushing": "Caballero empujando",
        "netForce": "Fuerza neta",
        "restart": "REINICIAR",
        "credits_detail": "Escrito por: David Dionisio\r\nMúsica de: Kevin MacLeod",
        "newton_first_law_dlg_block2_1": "Este bloque no tiene ruedas. La fuerza de fricción permitirá que el bloque resista una cierta cantidad de empuje o tirón de los lados.",
        "forcePush": "Fuerza empuje",
        "music": "MÚSICA",
        "newton_second_law_dlg_4_2": "Un vector tiene un valor para cada eje. En este caso, las x e y. Estos valores pueden indicarnos la dirección y la magnitud.",
        "examples": "Ejemplos",
        "newton_second_law_dlg_9": "¡Los nefastos duendes han aparecido de la nada! Seguramente no están tramando nada bueno. Empújalos por el acantilado con el volante.",
        "newton_first_law_dlg_landed_2": "¡Adelante y llama a un caballero poderoso para empujar el objeto!",
        "off": "APAGADO",
        "forceUnbalanced": "Fuerza desequilibrada",
        "velocity": "VELOCIDAD",
        "newton_first_law_inertia_2_dlg_1": "En este escenario, aprenderemos más sobre la inercia.",
        "newton_second_law_2_dlg_1": "¡Cuidado! ¡Han aparecido más duendes!",
        "newton_first_law_dlg_kidnap_1": "¡Oh, no! ¡La princesa ha sido tomada como rehén por estos nefastos duendes!"
    }
}