{
  "_meta": {
    "maxChars": {
      "welcome": "50"
    }
  },
  "en": {
    "welcome": "Welcome!",
    "title": "Knights of the Force Academy",
    "options": "OPTIONS",
    "music": "MUSIC",
    "sound": "SOUND",
    "on": "ON",
    "off": "OFF",
    "close": "CLOSE",
    "yes": "YES",
    "no": "NO",
    "confirmDesc": "Are you sure you want to restart the level?",
    "confirmTitleRestart": "RESTART",
    "restart": "RESTART",
    "victory": "VICTORY",
    "velocityX": "velocity(x)",
    "velocityY": "velocity(y)",
    "victory_act_1_1": "You have rescued the princess!",
    "newton_first_law_title": "Newton's First Law",
    "newton_first_law_desc": "Newton's first law states that an object at rest will remain at rest, and an object in motion will maintain a constant velocity unless acted upon by a net external force.",
    "newton_at_rest": "At Rest",
    "newton_in_motion": "In Motion",
    "newton_balanced_force": "Balanced force.",
    "newton_zero_accel": "Acceleration = 0 m/s²",
    "forceGravity": "Force Gravity",
    "forceNormal": "Force Normal",
    "forceFriction": "Force Friction",
    "forcePush": "Force Push",
    "forceZeroNetForce": "0 Net Force",
    "force": "Force",
    "forceBalanced": "Force Balanced",
    "forceUnbalanced": "Force Unbalanced",
    "weight": "Weight",
    "position": "POSITION",
    "velocity": "VELOCITY",
    "acceleration": "ACCELERATION",
    "axis": "Axis",
    "timeSlider": "Time: {0:0.0} - {1:0.0} seconds",
    "launch": "LAUNCH",
    "newton_first_law_dlg_1": "A net external force is the sum of all forces acting on the object. If the net external force is zero, then there is no acceleration.",
    "newton_first_law_dlg_1_2": "I will now drop a large object from the sky to demonstrate.",
    "newton_first_law_dlg_2": "There are two forces currently acting on this object: gravity and normal force.",
    "newton_first_law_dlg_3": "The gravity force is pulling the object towards the Earth, which allows it to fall in the first place.",
    "newton_first_law_dlg_3_2": "The normal force is pushing the object outwards from the surface.",
    "newton_first_law_dlg_4": "Adding both the gravity and normal force will result in zero net force. Therefore the object is at rest.",
    "newton_first_law_dlg_5": "It looks like the princess has been taken hostage by these nefarious goblins!",
    "newton_first_law_dlg_6": "Let us summon our mighty knights for a daring rescue!",
    "newton_first_law_inertia_dlg_1": "Excellent! Notice how it took a couple of knights to push the block?",
    "newton_first_law_inertia_dlg_2": "The block's mass gives it more weight, which allows its frictional force to go against the pushing force of the knights.",
    "newton_first_law_inertia_dlg_3": "The mass of an object determines the object’s inertia. The unit of measurement shown here is in kg (kilograms), which is 1000 grams per 1 kilogram.",
    "newton_first_law_inertia_dlg_4": "Inertia is the tendency of any physical object to resist any change in motion. A change in motion is acceleration due to net force acting on the object.",
    "newton_first_law_inertia_dlg_5": "I will now drop another object from the sky. This time with less mass. Just one more block to rescue our damsel in distress!",
    "newton_first_law_inertia_2_dlg_1": "In this scenario, we will learn more about inertia, and how it relates to mass.",
    "newton_first_law_inertia_2_dlg_2": "Observe how the forces interact on this balance scale.",
    "newton_first_law_inertia_2_dlg_3": "The weight of the objects on each platform influences the tipping of the scale. If objects on both platforms have an equal amount of weight, they will align horizontally.",
    "newton_first_law_inertia_2_dlg_4": "Here's a locked treasure chest found in the dark recesses of a dungeon. Drag the correct amount of weights on the right platform to unlock it.",
    "newton_first_law_inertia_2_victory": "You have opened the treasure chest! Behold, the riches uncovered:",
    "knightPushing": "Knight Pushing",
    "constantMotion": "Constant Motion",
    "falling": "Falling due to Gravity",
    "newton_second_law_title": "Newton's Second Law",
    "newton_second_law_desc": "Newton's second law states that the acceleration of an object is proportional to the net force acting on it, and inversely proportional to its mass.",
    "pressLaunch": "Press the LAUNCH button.",
    "pressGraph": "Press the GRAPH button.",
    "dragForceSlider": "Drag the slider to change the Force value.",
    "mass": "Mass",
    "accel": "Acceleration",
    "vel": "Velocity",
    "vector": "Vector",
    "direction": "Direction",
    "magnitude": "Magnitude",
    "examples": "Examples",
    "newton_second_law_dlg_1": "Acceleration is what causes an object’s velocity to change over time. Which means the object will speed up, slow down, or change direction.",
    "newton_second_law_dlg_2": "Here are the equations for both the net force (F-net), and acceleration (A). Where mass is kilograms (kg), distance is meters (m), and time is seconds (s).",
    "newton_second_law_dlg_3": "As you can see, the more mass an object has, the less it will accelerate from the net force.",
    "newton_second_law_dlg_4": "Note that: force, acceleration, and velocity are all vectors.",
    "newton_second_law_dlg_4_2": "A vector is composed of a value for each axis. In this case, the x and y. These values can also tell us the direction, and the magnitude.",
    "newton_second_law_dlg_5": "A valiant knight has brought us a wheel to demonstrate. The wheel is enchanted with magical trails to allow us to observe its motion.",
    "newton_second_law_dlg_6": "The first few trails are where the knight was pushing the wheel. You can see that the distance between them are increasing.",
    "newton_second_law_dlg_7": "At this point, the distance between each trail is equal. This means that the net force acting on the wheel equals zero.",
    "newton_second_law_dlg_8": "The trails here are going down. We can observe that the only force acting on the wheel is the gravity.",
    "newton_second_law_graph_1": "The graph maps out the trails across time along the x and y axis. Be sure to check the velocity and acceleration by scrolling down.",
    "newton_second_law_graph_2": "Observe how the position line curves as velocity increases, indicating that there is acceleration.",
    "newton_second_law_graph_3": "If the position line is straight, then velocity is constant, and therefore no acceleration.",
    "newton_second_law_dlg_9": "The nefarious goblins have appeared out of thin air! They are surely up to no good. Push them off the cliff using the wheel.",
    "pressToProceed": "Press this button when you are ready to continue.",
    "targetsEliminated": "Targets Eliminated",
    "dragAngleHelp": "Drag the knob to adjust the cannon's angle.",
    "graphReminder": "Remember to check the graph to analyze the trajectory of the cannonball.",
    "newton_second_law_2_dlg_1": "Hark! More goblins have appeared! This time, they have positioned themselves at different heights.",
    "newton_second_law_2_dlg_2": "But fear not, we have the very tool to get the job done.",
    "newton_second_law_2_dlg_3": "Let us bring forth the mighty cannon to vanquish these vermin!",
    "newton_second_law_2_dlg_4": "In this scenario, we are applying force to a cannonball with explosion.",
    "newton_second_law_2_dlg_5": "This short burst of force will allow the cannonball to accelerate within a fraction of a second to reach high velocity.",
    "dragForcePushHelp": "Drag the Force Field to this surface.",
    "dragForceAdjustHelp": "You can reposition a Force Field by dragging it.",
    "playButtonHelp": "Press this button to start the simulation.",
    "trashButtonHelp": "Press and hold the trash button to clear out the Force Fields.",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": ""
  }
}