{
  "_meta": {
    "maxChars": {
      "welcome": "50"
    }
  },
  "en": {
    "welcome": "Welcome!",
    "title": "Mighty Force Knights\n<size=30>Newton's Law 1 and 2</size>",
    "options": "OPTIONS",
    "music": "MUSIC",
    "sound": "SOUND",
    "on": "ON",
    "off": "OFF",
    "close": "CLOSE",
    "yes": "YES",
    "no": "NO",
    "confirmDesc": "Are you sure you want to restart the level?",
    "confirmTitleRestart": "RESTART",
    "restart": "RESTART",
    "credits": "CREDITS",
    "credits_detail": "Written by: David Dionisio\nMusic from: Kevin MacLeod",
    "begin": "BEGIN",
    "proceed": "PROCEED",
    "victory": "VICTORY",
    "velocityX": "velocity(x)",
    "velocityY": "velocity(y)",
    "victory_act_1_1": "The princess has been rescued!",
    "act_1": "Act 1",
    "act_2": "Act 2",
    "act_3": "Act 3",
    "newton_first_law_title": "Newton's First Law",
    "newton_first_law_desc": "Newton's first law states that an object at rest will remain at rest, and an object in motion will maintain a constant velocity unless acted upon by a net external force.",
    "newton_at_rest": "At Rest",
    "newton_in_motion": "In Motion",
    "newton_balanced_force": "Balanced force.",
    "newton_zero_accel": "Acceleration = 0 m/s²",
    "forceGravity": "Force Gravity",
    "forceNormal": "Force Ground",
    "forceFriction": "Force Friction",
    "forcePush": "Force Push",
    "forceZeroNetForce": "0 Net Force (Balanced)",
    "force": "Force",
    "forceBalanced": "Force Balanced",
    "forceUnbalanced": "Force Unbalanced",
    "netForce": "Net Force",
    "weight": "Weight",
    "position": "POSITION",
    "velocity": "VELOCITY",
    "acceleration": "ACCELERATION",
    "axis": "Axis",
    "secondsFormat": "{0:0.0} seconds",
    "timeSlider": "Time: {0:0.0} - {1:0.0} seconds",
    "launch": "LAUNCH",
    "mass_inertia": "Mass = Inertia",
    "weight_gravity": "Weight = Force of Gravity",
    "newton_first_law_dlg_1": "This means that an object will keep doing what it is doing, be it sitting or moving, until it is bothered by a bunch of forces (net force).",
    "newton_first_law_dlg_kidnap_1": "Oh no! The princess has been taken hostage by these nefarious goblins!",
    "newton_first_law_dlg_kidnap_2": "Let me drop an object that will help us in this predicament. This will show us the first law in action.",
    "newton_first_law_dlg_gravity": "The gravity force is pulling the object towards Earth, which allows it to fall.",
    "newton_first_law_dlg_landed_1": "Now that the object has landed, the ground is pushing it up. This cancels out the gravity force. The object is now at rest.",
    "newton_first_law_dlg_landed_2": "Go ahead and summon a mighty knight to push the object!",
    "newton_first_law_dlg_goblins_1": "The goblins are pushing back! This brings the net force (sum of forces) back to zero.",
    "newton_first_law_dlg_goblins_2": "Summon more knights to overcome the goblins on the other side!",
    "newton_first_law_dlg_next_1": "Excellent! As you can see, the side with more force will determine the direction of the net force acting on the object.",
    "newton_first_law_dlg_next_2": "We need one more block to rescue our damsel in distress!",
    "newton_first_law_dlg_block2_1": "This block has no wheels. The force of friction will allow the block to resist a certain amount of push or pull from all sides.",
    "newton_first_law_dlg_block2_2": "We have enough knights to overcome this force. Summon the mighty knights for this one last push!",
    "newton_first_law_inertia_2_dlg_1": "In this scenario, we will learn more about inertia.",
    "newton_first_law_inertia_2_dlg_1_a": "Mass is a measure of inertia. It tells us how much resistance an object has in changing motion.",
    "newton_first_law_inertia_2_dlg_1_b": "The weight of an object is essentially the force of gravity.",
    "newton_first_law_inertia_2_dlg_2": "Observe how the forces are interacting on this balance scale.",
    "newton_first_law_inertia_2_dlg_3": "The weight on each platform causes the scale to tip. If both platforms have equal weight, they will align horizontally.",
    "newton_first_law_inertia_2_dlg_4": "Here's a locked treasure chest as a demonstration. Put the correct amount of weight on the other platform to unlock it.",
    "newton_first_law_inertia_2_victory": "You have opened the treasure chest! Behold, the riches uncovered:",
    "dragWeightsHelp": "Drag these weights on top of the platform.",
    "knightPushing": "Knight Pushing",
    "constantMotion": "Constant Motion",
    "falling": "Falling due to Gravity",
    "newton_second_law_title": "Newton's Second Law",
    "newton_second_law_desc": "Newton's second law states that the acceleration of an object is proportional to the net force acting on it, and inversely proportional to its mass.",
    "pressLaunch": "Press the LAUNCH button.",
    "pressGraph": "Press the GRAPH button.",
    "dragForceSlider": "Drag the slider to change the Force value.",
    "mass": "Mass",
    "accel": "Acceleration",
    "vel": "Velocity",
    "vector": "Vector",
    "direction": "Direction",
    "magnitude": "Magnitude",
    "examples": "Examples",
    "newton_second_law_dlg_1": "Acceleration is what causes an object’s velocity to change over time. Which means the object will speed up, slow down, or change direction.",
    "newton_second_law_dlg_2": "Here are the equations for both the net force (F-net), and acceleration (A). Where mass is kilograms (kg), distance is meters (m), and time is seconds (s).",
    "newton_second_law_dlg_3": "As you can see, the more mass an object has, the less it will accelerate from the net force.",
    "newton_second_law_dlg_4": "Note that: force, acceleration, and velocity are all vectors.",
    "newton_second_law_dlg_4_2": "A vector has a value for each axis. In this case, the x and y. These values can tell us the direction, and the magnitude.",
    "newton_second_law_dlg_5": "A mighty knight has brought us a wheel to demonstrate. The wheel is enchanted with magical trails to allow us to observe its motion.",
    "newton_second_law_dlg_6": "The knight is pushing the wheel. The velocity in the X-axis is increasing.",
    "newton_second_law_dlg_7": "The wheel continues to roll. There is no change in velocity.",
    "newton_second_law_dlg_8": "As the wheel falls, the velocity in the Y-axis starts to decrease.",
    "newton_second_law_graph_1": "The graph maps out the trails across time along the x and y axis. Be sure to check the velocity and acceleration by scrolling down.",
    "newton_second_law_graph_2": "Observe how the position line curves as velocity increases, indicating that there is acceleration.",
    "newton_second_law_graph_3": "If the position line is straight, then velocity is constant, and therefore no acceleration.",
    "newton_second_law_dlg_9": "The nefarious goblins have appeared out of thin air! They are surely up to no good. Push them off the cliff with the wheel.",
    "pressToProceed": "Press this button when you are ready to continue.",
    "targetsEliminated": "Targets Eliminated",
    "dragAngleHelp": "Drag this to adjust the cannon's angle.",
    "graphReminder": "Remember to check the graph to analyze the trajectory of the cannonball.",
    "newton_second_law_2_dlg_1": "Beware! More goblins have appeared!",
    "newton_second_law_2_dlg_3": "Let us bring forth the mighty cannon to vanquish these vermin!",
    "newton_second_law_2_dlg_5": "As you fire away, observe that the projectile will move at a constant velocity along the X-axis.",
    "dragForcePushHelp": "Drag the Force Field to this surface.",
    "dragForceAdjustHelp": "You can reposition a Force Field by dragging it.",
    "playButtonHelp": "Press this button to start the simulation.",
    "trashButtonHelp": "Press and hold the trash button to clear out the Force Fields.",
    "act_3_title": "The Golden Ball",
    "act_2_end_dlg_1": "A large meteorite is approaching Earth! Total destruction awaits us if nothing is done!",
    "act_2_end_dlg_2": "Seek the golden ball, for it will grant you the force to thwart the impending doom.",
    "end_title": "GLORY IS YOURS",
    "end_desc": "Thank you for playing!",
    "finish": "FINISH",
    "hintTooltip": "Press this button to show hints.",
    "timeSliderWheelHint": "Drag the slider to observe the wheel's motion over time.",
    "knightsForcePush": "Knight's Force Push",
    "wheelsAcceleration": "Wheel's Acceleration",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": ""
  }
}